package day_6;

// 1. В классах Автомобиль и Мотоцикл реализовать два метода:
//info() - выводит в консоль строку “Это автомобиль” (или “Это мотоцикл”),
// yearDifference() - принимает на вход число (год),
// и возвращает разницу между переданным годом и годом выпуска транспортного средства

// 2. Создать конструктор в классе Самолет, принимающий в качестве аргументов значения четырех
// полей класса (значение поля “количество топлива в баке” установить равным 0).
// В конструкторе для передачи полям значений использовать ключевое слово this.
// Помимо этого, в классе необходимо реализовать метод info(), который выводит сообщение в следующем формате:
//“Изготовитель: ... , год выпуска: ... , длина: ..., вес: ..., количество топлива в баке: ...”
// Также, необходимо реализовать метод fillUp(), который в качестве аргумента принимает
// число и заправляет топливный бак самолета на это значение.
//Создать новый объект класса Самолет с произвольными данными.
//Изменить год выпуска и длину с помощью сеттеров, вызвать метод fillUp() два раза, передав разные значения.
// Вызвать метод info().

// 3. Создать класс Teacher(Преподаватель), имеющий поля “Имя”, “Предмет”.
// Создать класс Student(Студент) с полем “Имя”.
//Каждый класс имеет конструктор (с параметрами), set и get методы по необходимости,
// а также у преподавателя есть метод evaluate(оценить студента), принимающий в качестве аргумента студента,
// и работающий следующим образом: внутри метода случайным образом генерируется число от 2 до 5, выводится строка:
// "Преподаватель ИМЯПРЕПОДАВАТЕЛЯ оценил студента с именем ИМЯСТУДЕНТА по предмету ИМЯПРЕДМЕТА на оценку ОЦЕНКА."
//Все слова, написанные большими буквами, должны быть заменены соответствующими значениями.
// ОЦЕНКА должна принимать значения "отлично”, "хорошо”, "удовлетворительно" или "неудовлетворительно",
// в зависимости от значения случайного числа.

public class TestJava {
    public static void main(String[] args) {
        Car car = new Car();
        car.setYearOfManufacture(2000);
        car.setColor("Black");
        car.setName("BMV");

        System.out.println("Год выпуска автомобиля: " + car.getYearOfManufacture());
        System.out.println("Цвет автомобиля: " + car.getColor());
        System.out.println("Марка автомобиля: " + car.getName());
        car.info();
        car.yearDifference(2014);


        Motorbike motorbike = new Motorbike(2005, "White", "Mercedes");

        System.out.println("Год выпуска мотоцикла: " + motorbike.getYearOfManufacture());
        System.out.println("Цвет мотоцикла: " + motorbike.getColor());
        System.out.println("Марка мотоцикла: " + motorbike.getName());
        motorbike.info();
        motorbike.yearDifference(2000);

        Airplane airplane = new Airplane("Nikita", 2020, 144, 10000, 0);
        airplane.info();
        airplane.setFuel(airplane.fillUp(10));
        airplane.info();

        System.out.println();

        Teacher teacher = new Teacher();
        Student student = new Student();

        student.setName("Nikita");
        teacher.setName("Ana");
        teacher.setObject("Java");
        teacher.evaluate(student);
    }
}
